-- task 1
-- fmapX sinusX



-- task 2
-- липовачи

-- бесконечный список простых чисел (решето эратосфена)

-- посмотреть в липовачи функции для доступа к компонентам data
-- прочитать в липовачи как сделать собственные классы типов

-- foldl, foldr (где получится хвостовой)

-- развенуть в список двоичных разраядов или простых едлителей



-- task X
-- архиватор, архивирующий текстовые файлы, 
-- потоковые данные (поток байт) в файл архива должен записывать и кодовую 
-- таблицу и поток бит (результат сжимающего кодирования)
-- используя алгоритм хаффмана
